1033087886/esp32-cam/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <Preferences.h>
#include <WebServer.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <PubSubClient.h>
#include <ArduinoWebsockets.h>
#include <tiny_websockets/network/tcp_client.hpp>
#include "esp_camera.h"
#include <time.h>
#include <string.h>
#include <ctype.h>
#include <memory>
#include "esp_netif.h"
#include "lwip/ip6_addr.h"
#include "lwip/sockets.h"
#include "esp_tls.h"
#if __has_include("esp_crt_bundle.h")
#include "esp_crt_bundle.h"
#define HAS_ESP_CRT_BUNDLE 1
#elif __has_include(<esp_crt_bundle.h>)
#include <esp_crt_bundle.h>
#define HAS_ESP_CRT_BUNDLE 1
#else
#define HAS_ESP_CRT_BUNDLE 0
#endif
#if __has_include(<esp32/spiram.h>)
#include <esp32/spiram.h>
#define HAS_SPIRAM_CHIP_API 1
#else
#define HAS_SPIRAM_CHIP_API 0
#endif

#if __has_include(<esp_arduino_version.h>)
#include <esp_arduino_version.h>
#endif

#ifndef GC2145_PID
#define GC2145_PID 0x2145
#endif

#ifndef CAM_FORCE_SENSOR
#define CAM_FORCE_SENSOR auto
#endif

#ifndef STREAM_WS_HOST
#define STREAM_WS_HOST "stream.rose980.eu.cc"
#endif

#ifndef STREAM_WS_ROOM
#define STREAM_WS_ROOM "cam01"
#endif

#ifndef STREAM_WS_TOKEN
#define STREAM_WS_TOKEN ""
#endif

#define CAM_STRINGIFY_IMPL(value) #value
#define CAM_STRINGIFY(value) CAM_STRINGIFY_IMPL(value)
#define STREAM_WS_PATH_LITERAL "/esp32?room=" STREAM_WS_ROOM "&token=" STREAM_WS_TOKEN
#define STREAM_WS_URL_LITERAL "wss://" STREAM_WS_HOST STREAM_WS_PATH_LITERAL

#if __has_include("sensors/private_include/gc2145_settings.h")
#define HAS_GC2145_DRIVER_HEADER_HINT 1
#else
#define HAS_GC2145_DRIVER_HEADER_HINT 0
#endif

#if HAS_ESP_CRT_BUNDLE
extern "C" esp_err_t arduino_esp_crt_bundle_attach(void* conf) __attribute__((weak));
extern "C" esp_err_t esp_crt_bundle_attach(void* conf) __attribute__((weak));

static esp_err_t (*resolveCrtBundleAttach())(void*) {
  if (arduino_esp_crt_bundle_attach != nullptr) {
    return arduino_esp_crt_bundle_attach;
  }
  if (esp_crt_bundle_attach != nullptr) {
    return esp_crt_bundle_attach;
  }
  return nullptr;
}
#endif

using namespace websockets;

class EspTlsSecuredTcpClient : public websockets::network::TcpClient {
public:
  explicit EspTlsSecuredTcpClient(const char* caCert)
    : _tls(nullptr), _connected(false), _caCert(caCert) {
    _keepAlive.keep_alive_enable = true;
    _keepAlive.keep_alive_idle = 5;
    _keepAlive.keep_alive_interval = 5;
    _keepAlive.keep_alive_count = 3;
  }

  bool connect(const WSString& host, int port) override {
    close();
    _host = host;

    esp_tls_cfg_t cfg = {};
    cfg.timeout_ms = 10000;
    cfg.keep_alive_cfg = &_keepAlive;
    cfg.common_name = _host.c_str();

    if (_caCert != nullptr && strlen(_caCert) > 0) {
      cfg.cacert_buf = reinterpret_cast<const unsigned char*>(_caCert);
      cfg.cacert_bytes = strlen(_caCert) + 1;
    }

#if HAS_ESP_CRT_BUNDLE
    if (cfg.cacert_buf == nullptr && cfg.cacert_bytes == 0) {
      esp_err_t (*crtBundleAttach)(void*) = resolveCrtBundleAttach();
      if (crtBundleAttach != nullptr) {
        cfg.crt_bundle_attach = crtBundleAttach;
      }
    }
#endif

    _tls = esp_tls_init();
    if (_tls == nullptr) {
      return false;
    }

    int ret = esp_tls_conn_new_sync(_host.c_str(), _host.length(), port, &cfg, _tls);
    if (ret != 1) {
      int tlsCode = 0;
      int tlsFlags = 0;
      if (_tls != nullptr && _tls->error_handle != nullptr) {
        esp_tls_get_and_clear_last_error(_tls->error_handle, &tlsCode, &tlsFlags);
      }
      Serial.printf(
        "[WS][TLS] connect failed ret=%d tlsCode=0x%X tlsFlags=0x%X host=%s port=%d\n",
        ret,
        tlsCode,
        tlsFlags,
        _host.c_str(),
        port
      );
      esp_tls_conn_destroy(_tls);
      _tls = nullptr;
      _connected = false;
      return false;
    }

    _connected = true;
    return true;
  }

  bool poll() override {
    if (!_connected || _tls == nullptr) return false;

    int avail = esp_tls_get_bytes_avail(_tls);
    if (avail > 0) return true;

    int sockfd = -1;
    if (esp_tls_get_conn_sockfd(_tls, &sockfd) != ESP_OK || sockfd < 0) return false;

    fd_set readSet;
    FD_ZERO(&readSet);
    FD_SET(sockfd, &readSet);
    timeval tv = {};
    tv.tv_sec = 0;
    tv.tv_usec = 0;

    int rc = lwip_select(sockfd + 1, &readSet, nullptr, nullptr, &tv);
    return rc > 0;
  }

  bool available() override {
    return _connected && _tls != nullptr;
  }

  void send(const WSString& data) override {
    send(reinterpret_cast<const uint8_t*>(data.c_str()), data.size());
  }

  void send(const WSString&& data) override {
    send(reinterpret_cast<const uint8_t*>(data.c_str()), data.size());
  }

  void send(const uint8_t* data, const uint32_t len) override {
    if (!_connected || _tls == nullptr || data == nullptr || len == 0) return;

    uint32_t total = 0;
    while (total < len) {
      int written = esp_tls_conn_write(
        _tls,
        reinterpret_cast<const char*>(data + total),
        static_cast<size_t>(len - total)
      );
      if (written <= 0) {
        _connected = false;
        return;
      }
      total += static_cast<uint32_t>(written);
    }
  }

  WSString readLine() override {
    WSString line;
    if (!_connected || _tls == nullptr) return line;

    const uint32_t timeoutMs = 8000;
    unsigned long start = millis();
    while (_connected && millis() - start < timeoutMs) {
      char ch = 0;
      int ret = esp_tls_conn_read(_tls, &ch, 1);
      if (ret == 1) {
        line += ch;
        if (ch == '\n') {
          break;
        }
      } else if (ret == 0) {
        _connected = false;
        break;
      } else {
        delay(1);
      }
    }
    return line;
  }

  uint32_t read(uint8_t* buffer, const uint32_t len) override {
    if (!_connected || _tls == nullptr || buffer == nullptr || len == 0) return 0;
    int ret = esp_tls_conn_read(_tls, reinterpret_cast<char*>(buffer), len);
    if (ret <= 0) {
      if (ret == 0) {
        _connected = false;
      }
      return 0;
    }
    return static_cast<uint32_t>(ret);
  }

