1033087886/esp32-cam/src/main.cpp
  void close() override {
    if (_tls != nullptr) {
      esp_tls_conn_destroy(_tls);
      _tls = nullptr;
    }
    _connected = false;
  }

  ~EspTlsSecuredTcpClient() override {
    close();
  }

protected:
  int getSocket() const override {
    return -1;
  }

private:
  esp_tls_t* _tls;
  bool _connected;
  const char* _caCert;
  WSString _host;
  tls_keep_alive_cfg_t _keepAlive;
};

enum class CameraSensorProfile : uint8_t {
  UNKNOWN = 0,
  OV2640,
  OV3660,
  GC2145
};

enum class WiFiControlState : uint8_t {
  BOOT = 0,
  CONNECTING,
  CONNECTED,
  PROVISIONING
};

void connectWiFi();
void maintainWiFiConnection();
void beginProvisioningCandidate(const String& ssid, const String& password);
bool loadStoredWiFiCredentials();
void saveStoredWiFiCredentials(const String& ssid, const String& password);
void clearStoredWiFiCredentials();
void startProvisioningAp(const char* reason);
void stopProvisioningAp();
void setupProvisioningServer();
void handleProvisioningRoot();
void handleProvisioningScan();
void handleProvisioningConnect();
void handleProvisioningStatus();
void handleProvisioningReset();
void handleProvisioningNotFound();
String buildProvisioningStatusJson();
String escapeJson(const String& value);
const char* wifiControlStateToString(WiFiControlState state);
const char* wifiAuthModeToString(wifi_auth_mode_t authMode);
void doPortalAuth();
void testInternet();
void setupMqttTransport();
void syncTimeIfNeeded();
void connectMQTT();
void onWiFiEvent(WiFiEvent_t event);
void requestIPv6(const char* reason);
void refreshIPv6Status(bool verbose);
const char* classifyIPv6Type(const esp_ip6_addr_t& addr);
int ipv6TypeScore(const char* type);
void mqttCallback(char* topic, byte* payload, unsigned int length);
void publishHeartbeat();
void publishLightState();
void setFlashBrightness(uint8_t value, bool reportState);
String decodeCommandPayload(byte* payload, unsigned int length);
bool parseBrightnessCommand(String cmd, uint8_t& outValue);
bool initCamera();
void connectStreamWs();
void sendStreamFrameIfReady();
void setupTopics();
void setupFlashPwm();
void publishAck(const char* msg);
String extractJsonValue(const String& json, const String& key);
void printMemoryInfo(const char* stage);
const char* psramChipSizeText(int chipEnum);
const char* cameraSensorProfileToString(CameraSensorProfile profile);
CameraSensorProfile cameraSensorProfileFromPid(uint16_t pid);
CameraSensorProfile parseForcedSensorProfile(
  const char* raw,
  bool* forceEnabled,
  bool* valueValid,
  char* normalized,
  size_t normalizedSize
);
const char* pixformatToString(pixformat_t pixformat);
const char* frameSizeToString(framesize_t frameSize);
template <typename T>
bool applySensorSetting(sensor_t* sensor, const char* settingName, T value, int (*setter)(sensor_t*, T));

#ifndef DEFAULT_WIFI_SSID
#define DEFAULT_WIFI_SSID ""
#endif

#ifndef DEFAULT_WIFI_PASSWORD
#define DEFAULT_WIFI_PASSWORD ""
#endif

const char* wifiPrefsNamespace = "wifi_cfg";
const uint32_t wifiPrefsVersion = 1;
const unsigned long wifiConnectTimeoutInitial = 20000UL;
const unsigned long wifiConnectTimeoutRecovery = 60000UL;
const char* provisioningApPrefix = "ESP32CAM-";
const IPAddress provisioningApIp(192, 168, 4, 1);

const char provisioningPageHtml[] PROGMEM = R"HTML(
<!doctype html>
<html lang="zh-CN">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <title>ESP32-CAM 配网</title>
  <style>
    :root { color-scheme: light dark; }
    body { font-family: Arial, sans-serif; margin: 0; background: #0f172a; color: #e2e8f0; }
    .wrap { max-width: 760px; margin: 0 auto; padding: 20px; }
    .card { background: #111827; border-radius: 16px; padding: 18px; margin-bottom: 16px; box-shadow: 0 8px 30px rgba(0,0,0,.25); }
    h1, h2 { margin-top: 0; }
    label { display: block; margin: 12px 0 6px; font-weight: 600; }
    input, button { width: 100%; box-sizing: border-box; border-radius: 10px; border: 1px solid #334155; padding: 12px; font-size: 16px; }
    input { background: #0b1220; color: #e2e8f0; }
    button { background: #2563eb; color: white; border: 0; cursor: pointer; margin-top: 10px; }
    button.secondary { background: #334155; }
    button.warn { background: #b91c1c; }
    ul { list-style: none; padding: 0; margin: 0; }
    li { padding: 12px; border-radius: 10px; background: #0b1220; margin-bottom: 8px; cursor: pointer; }
    .muted { color: #94a3b8; }
    .status { white-space: pre-wrap; line-height: 1.6; }
    .row { display: grid; grid-template-columns: 1fr 1fr; gap: 12px; }
    @media (max-width: 640px) { .row { grid-template-columns: 1fr; } }
  </style>
</head>
<body>
  <div class="wrap">
    <div class="card">
      <h1>ESP32-CAM 配网</h1>
      <div id="status" class="status muted">正在读取状态...</div>
    </div>

    <div class="card">
      <div class="row">
        <button type="button" onclick="scanNetworks()">扫描附近 Wi‑Fi</button>
        <button type="button" class="secondary" onclick="refreshStatus()">刷新状态</button>
      </div>
      <div id="scanHint" class="muted" style="margin-top:10px">点击上方按钮获取网络列表，也可以手动输入隐藏 SSID。</div>
      <ul id="networks" style="margin-top:12px"></ul>
    </div>

    <div class="card">
      <h2>连接新的 Wi‑Fi</h2>
      <form id="wifiForm">
        <label for="ssid">Wi‑Fi 名称 (SSID)</label>
        <input id="ssid" name="ssid" autocomplete="off" placeholder="输入或点击上方列表自动填充">
        <label for="password">Wi‑Fi 密码</label>
        <input id="password" name="password" type="password" placeholder="至少 8 位，开放网络可留空">
        <button type="submit">保存并连接</button>
      </form>
      <button type="button" class="warn" onclick="resetConfig()">清除已保存配置并重新配网</button>
    </div>
  </div>

  <script>
    const statusEl = document.getElementById('status');
    const scanHintEl = document.getElementById('scanHint');
    const networksEl = document.getElementById('networks');
    const ssidEl = document.getElementById('ssid');
    const passwordEl = document.getElementById('password');

    function pickNetwork(name) {
      ssidEl.value = name;
      passwordEl.focus();
    }

    function renderStatus(data) {
      const lines = [
        `设备: ${data.device_id || '-'}`,
        `状态: ${data.state || '-'}`,
        `当前 Wi‑Fi: ${data.connected_ssid || '-'}`,
        `已保存 Wi‑Fi: ${data.saved_ssid || '-'}`,
        `STA IP: ${data.sta_ip || '-'}`,
        `AP 热点: ${data.ap_ssid || '-'} (${data.ap_ip || '-'})`,
        `提示: ${data.message || '-'}`
      ];
      statusEl.textContent = lines.join('\n');
    }

