1033087886/esp32-cam/src/main.cpp
    async function refreshStatus() {
      try {
        const resp = await fetch('/status');
        const data = await resp.json();
        renderStatus(data);
      } catch (err) {
        statusEl.textContent = '读取状态失败: ' + err;
      }
    }

    async function scanNetworks() {
      networksEl.innerHTML = '';
      scanHintEl.textContent = '扫描中，请稍候...';
      try {
        const resp = await fetch('/scan');
        const data = await resp.json();
        const items = data.networks || [];
        if (!items.length) {
          scanHintEl.textContent = data.message || '没有扫描到 Wi‑Fi，请手动输入。';
          return;
        }
        scanHintEl.textContent = '点击列表项可自动填入 SSID。';
        items.forEach((item) => {
          const li = document.createElement('li');
          li.textContent = `${item.ssid}  ·  ${item.rssi} dBm  ·  ${item.auth}`;
          li.onclick = () => pickNetwork(item.ssid);
          networksEl.appendChild(li);
        });
      } catch (err) {
        scanHintEl.textContent = '扫描失败: ' + err;
      }
    }

    async function submitForm(event) {
      event.preventDefault();
      const ssid = ssidEl.value.trim();
      if (!ssid) {
        alert('SSID 不能为空');
        return;
      }
      const payload = new URLSearchParams({ ssid, password: passwordEl.value });
      const resp = await fetch('/connect', {
        method: 'POST',
        headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
        body: payload.toString()
      });
      const data = await resp.json();
      alert(data.message || '已提交，请等待设备连接');
      refreshStatus();
    }

    async function resetConfig() {
      if (!confirm('确定要清除已保存的 Wi‑Fi 配置吗？')) {
        return;
      }
      const resp = await fetch('/reset', { method: 'POST' });
      const data = await resp.json();
      alert(data.message || '已清除配置');
      refreshStatus();
    }

    document.getElementById('wifiForm').addEventListener('submit', submitForm);
    refreshStatus();
    scanNetworks();
    setInterval(refreshStatus, 2500);
  </script>
</body>
</html>
)HTML";

// Optional captive portal auth (from ESP32-mqtt project workflow)
const bool enablePortalAuth = false;
const char* portalAuthBaseUrl = "http://192.168.100.2:8080/wportal/Onekey";
const unsigned long authInterval = 14100000UL;  // 235 minutes
unsigned long previousAuthTime = 0;

// MQTT settings
const char* mqttHost = "hea1fbf1.ala.cn-hangzhou.emqxsl.cn";
const uint16_t mqttPort = 8883;
const char* mqttUsername = "rose";
const char* mqttPassword = "123456";
const bool mqttUseTls = true;

// Fill CA cert only when mqttUseTls=true and broker uses 8883
const char* mqttCaCert = R"EOF(
-----BEGIN CERTIFICATE-----
MIIDjjCCAnagAwIBAgIQAzrx5qcRqaC7KGSxHQn65TANBgkqhkiG9w0BAQsFADBh
MQswCQYDVQQGEwJVUzEVMBMGA1UEChMMRGlnaUNlcnQgSW5jMRkwFwYDVQQLExB3
d3cuZGlnaWNlcnQuY29tMSAwHgYDVQQDExdEaWdpQ2VydCBHbG9iYWwgUm9vdCBH
MjAeFw0xMzA4MDExMjAwMDBaFw0zODAxMTUxMjAwMDBaMGExCzAJBgNVBAYTAlVT
MRUwEwYDVQQKEwxEaWdpQ2VydCBJbmMxGTAXBgNVBAsTEHd3dy5kaWdpY2VydC5j
b20xIDAeBgNVBAMTF0RpZ2lDZXJ0IEdsb2JhbCBSb290IEcyMIIBIjANBgkqhkiG
9w0BAQEFAAOCAQ8AMIIBCgKCAQEAuzfNNNx7a8myaJCtSnX/RrohCgiN9RlUyfuI
2/Ou8jqJkTx65qsGGmvPrC3oXgkkRLpimn7Wo6h+4FR1IAWsULecYxpsMNzaHxmx
1x7e/dfgy5SDN67sH0NO3Xss0r0upS/kqbitOtSZpLYl6ZtrAGCSYP9PIUkY92eQ
q2EGnI/yuum06ZIya7XzV+hdG82MHauVBJVJ8zUtluNJbd134/tJS7SsVQepj5Wz
tCO7TG1F8PapspUwtP1MVYwnSlcUfIKdzXOS0xZKBgyMUNGPHgm+F6HmIcr9g+UQ
vIOlCsRnKPZzFBQ9RnbDhxSJITRNrw9FDKZJobq7nMWxM4MphQIDAQABo0IwQDAP
BgNVHRMBAf8EBTADAQH/MA4GA1UdDwEB/wQEAwIBhjAdBgNVHQ4EFgQUTiJUIBiV
5uNu5g/6+rkS7QYXjzkwDQYJKoZIhvcNAQELBQADggEBAGBnKJRvDkhj6zHd6mcY
1Yl9PMWLSn/pvtsrF9+wX3N3KjITOYFnQoQj8kVnNeyIv/iPsGEMNKSuIEyExtv4
NeF22d+mQrvHRAiGfzZ0JFrabA0UWTW98kndth/Jsw1HKj2ZL7tcu7XUIOGZX1NG
Fdtom/DzMNU+MeKNhJ7jitralj41E6Vf8PlwUHBHQRFXGU7Aj64GxJUTFy8bJZ91
8rGOmaFvE7FBcf6IKshPECBV1/MUReXgRPTqh5Uykw7+U0b6LJ3/iyK5S9kJRaTe
pLiaWN0bfVKfjllDiIGknibVb63dDcY3fe0Dkhvld1927jyNxF1WW6LZZm6zNTfl
MrY=
-----END CERTIFICATE-----
)EOF";

const char* deviceId = "esp32cam-01";

const unsigned long wifiReconnectInterval = 5000UL;
const unsigned long mqttReconnectInterval = 5000UL;
const unsigned long mqttHeartbeatInterval = 30000UL;
const unsigned long wsReconnectInterval = 3000UL;
const unsigned long streamInterval = 100UL;  // ~10 FPS target (quality-first)
const unsigned long streamSendWarmupMs = 1000UL;
const unsigned long streamStatsInterval = 5000UL;
const size_t streamPreferredMaxFrameBytes = 85000;
const uint8_t streamJpegQualityPsram = 8;      // smaller value => higher quality/larger frame
const uint8_t streamJpegQualityNoPsram = 12;
const uint8_t streamJpegQualityMax = 12;
const unsigned long wsPingInterval = 15000UL;
const unsigned long ipv6RetryInterval = 4000UL;
const uint8_t ipv6MaxRetry = 15;
const framesize_t streamFrameSizePsram = FRAMESIZE_VGA;
const framesize_t streamFrameSizeNoPsram = FRAMESIZE_QVGA;

// Stream URL for Cloudflare Worker relay (no NAS).
// WS host/room/token are injected via build flags (see platformio.ini).
const char* streamWsUrl = STREAM_WS_URL_LITERAL;
const char* streamWsHost = STREAM_WS_HOST;
const uint16_t streamWsPort = 443;
const char* streamWsPath = STREAM_WS_PATH_LITERAL;
// WSS trust anchors for stream.rose980.eu.cc:
// - WE1 (intermediate)
// - GlobalSign ECC Root CA - R4 (root)
// Keeping both improves compatibility when edge chain formatting varies.
const char* streamWsCaCert = R"EOF(
-----BEGIN CERTIFICATE-----
MIICjjCCAjOgAwIBAgIQf/NXaJvCTjAtkOGKQb0OHzAKBggqhkjOPQQDAjBQMSQw
IgYDVQQLExtHbG9iYWxTaWduIEVDQyBSb290IENBIC0gUjQxEzARBgNVBAoTCkds
b2JhbFNpZ24xEzARBgNVBAMTCkdsb2JhbFNpZ24wHhcNMjMxMjEzMDkwMDAwWhcN
MjkwMjIwMTQwMDAwWjA7MQswCQYDVQQGEwJVUzEeMBwGA1UEChMVR29vZ2xlIFRy
dXN0IFNlcnZpY2VzMQwwCgYDVQQDEwNXRTEwWTATBgcqhkjOPQIBBggqhkjOPQMB
BwNCAARvzTr+Z1dHTCEDhUDCR127WEcPQMFcF4XGGTfn1XzthkubgdnXGhOlCgP4
mMTG6J7/EFmPLCaY9eYmJbsPAvpWo4IBAjCB/zAOBgNVHQ8BAf8EBAMCAYYwHQYD
VR0lBBYwFAYIKwYBBQUHAwEGCCsGAQUFBwMCMBIGA1UdEwEB/wQIMAYBAf8CAQAw
HQYDVR0OBBYEFJB3kjVnxP+ozKnme9mAeXvMk/k4MB8GA1UdIwQYMBaAFFSwe61F
uOJAf/sKbvu+M8k8o4TVMDYGCCsGAQUFBwEBBCowKDAmBggrBgEFBQcwAoYaaHR0
cDovL2kucGtpLmdvb2cvZ3NyNC5jcnQwLQYDVR0fBCYwJDAioCCgHoYcaHR0cDov
L2MucGtpLmdvb2cvci9nc3I0LmNybDATBgNVHSAEDDAKMAgGBmeBDAECATAKBggq
hkjOPQQDAgNJADBGAiEAokJL0LgR6SOLR02WWxccAq3ndXp4EMRveXMUVUxMWSMC
IQDspFWa3fj7nLgouSdkcPy1SdOR2AGm9OQWs7veyXsBwA==
-----END CERTIFICATE-----
-----BEGIN CERTIFICATE-----
MIIB3DCCAYOgAwIBAgINAgPlfvU/k/2lCSGypjAKBggqhkjOPQQDAjBQMSQwIgYD
VQQLExtHbG9iYWxTaWduIEVDQyBSb290IENBIC0gUjQxEzARBgNVBAoTCkdsb2Jh
bFNpZ24xEzARBgNVBAMTCkdsb2JhbFNpZ24wHhcNMTIxMTEzMDAwMDAwWhcNMzgw
MTE5MDMxNDA3WjBQMSQwIgYDVQQLExtHbG9iYWxTaWduIEVDQyBSb290IENBIC0g
UjQxEzARBgNVBAoTCkdsb2JhbFNpZ24xEzARBgNVBAMTCkdsb2JhbFNpZ24wWTAT
BgcqhkjOPQIBBggqhkjOPQMBBwNCAAS4xnnTj2wlDp8uORkcA6SumuU5BwkWymOx
uYb4ilfBV85C+nOh92VC/x7BALJucw7/xyHlGKSq2XE/qNS5zowdo0IwQDAOBgNV
HQ8BAf8EBAMCAYYwDwYDVR0TAQH/BAUwAwEB/zAdBgNVHQ4EFgQUVLB7rUW44kB/
+wpu+74zyTyjhNUwCgYIKoZIzj0EAwIDRwAwRAIgIk90crlgr/HmnKAWBVBfw147
bmF0774BxL4YSFlhgjICICadVGNA3jdgUM/I2O2dgq43mLyjj0xMqTQrbO/7lZsm
-----END CERTIFICATE-----
)EOF";

// ESP32-CAM (AI Thinker) pins
#define PWDN_GPIO_NUM 32
#define RESET_GPIO_NUM -1
#define XCLK_GPIO_NUM 0
#define SIOD_GPIO_NUM 26
#define SIOC_GPIO_NUM 27
#define Y9_GPIO_NUM 35
#define Y8_GPIO_NUM 34
#define Y7_GPIO_NUM 39
#define Y6_GPIO_NUM 36
#define Y5_GPIO_NUM 21
#define Y4_GPIO_NUM 19
#define Y3_GPIO_NUM 18
#define Y2_GPIO_NUM 5
#define VSYNC_GPIO_NUM 25
#define HREF_GPIO_NUM 23
#define PCLK_GPIO_NUM 22

