1033087886/esp32-cam/src/main.cpp
const uint8_t flashLedPin = 4;

#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
const bool useNewLedcApi = true;
#else
const bool useNewLedcApi = false;
const uint8_t flashLedChannel = 7;
#endif

WiFiClient mqttPlainClient;
WiFiClientSecure mqttTlsClient;
PubSubClient mqttClient(mqttPlainClient);
WebsocketsClient wsClient(std::make_shared<EspTlsSecuredTcpClient>(streamWsCaCert));
Preferences wifiPrefs;
WebServer provisioningServer(80);
bool wsConnected = false;
bool mqttUsingInsecure = false;

String topicCmdLight;
String topicStateLight;
String topicStateOnline;
String topicStateHeartbeat;
String topicAck;

uint8_t currentLight = 0;
unsigned long lastWifiRetryTime = 0;
unsigned long lastMqttConnectAttempt = 0;
unsigned long lastHeartbeatTime = 0;
unsigned long lastWsConnectAttempt = 0;
unsigned long lastFrameTime = 0;
unsigned long lastStreamStatTime = 0;
unsigned long lastWsPingTime = 0;
unsigned long wsConnectedAt = 0;
unsigned long wsReconnectCount = 0;
unsigned long streamFramesSent = 0;
unsigned long streamFramesDropped = 0;
unsigned long streamBytesSent = 0;
unsigned long wsBusyDropCount = 0;
uint8_t currentJpegQuality = 0;
bool wifiWasConnected = false;
bool wifiHasEverConnected = false;
bool provisioningApActive = false;
bool provisioningServerStarted = false;
bool pendingProvisionRequest = false;
bool pendingResetRequest = false;
bool pendingCredentialSave = false;
WiFiControlState wifiControlState = WiFiControlState::BOOT;
String savedWiFiSsid;
String savedWiFiPassword;
String connectTargetSsid;
String connectTargetPassword;
String pendingProvisionSsid;
String pendingProvisionPassword;
String provisioningApSsid;
String provisioningMessage = "初始化中";
unsigned long wifiConnectStartedAt = 0;
bool hasIPv6 = false;
String currentIPv6;
String currentIPv6Type = "NONE";
unsigned long lastIPv6TryTime = 0;
uint8_t ipv6TryCount = 0;
bool ipv6RetryExhaustedLogged = false;

void setup() {
  Serial.begin(115200);
  delay(150);
  Serial.println("\n--- ESP32-CAM MQTT + WS 推流启动 ---");
  printMemoryInfo("启动后");
  if (strlen(STREAM_WS_TOKEN) == 0) {
    Serial.println("[WS] 警告: STREAM_WS_TOKEN 为空，若 Worker 开启鉴权将返回 401");
  }

  WiFi.persistent(false);
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  WiFi.onEvent(onWiFiEvent);

  setupTopics();
  setupFlashPwm();
  setupProvisioningServer();

  if (!initCamera()) {
    Serial.println("[BOOT] 摄像头初始化失败，5秒后重启");
    delay(5000);
    ESP.restart();
  }
  printMemoryInfo("摄像头初始化后");

  setupMqttTransport();
  mqttClient.setServer(mqttHost, mqttPort);
  mqttClient.setCallback(mqttCallback);
  mqttClient.setBufferSize(512);
  mqttClient.setKeepAlive(60);
  mqttClient.setSocketTimeout(15);

  wsClient.onEvent([](WebsocketsEvent event, String data) {
    (void)data;
    if (event == WebsocketsEvent::ConnectionOpened) {
      wsConnected = true;
      wsConnectedAt = millis();
      lastWsPingTime = millis();
      lastStreamStatTime = millis();
      streamFramesSent = 0;
      streamFramesDropped = 0;
      streamBytesSent = 0;
      wsBusyDropCount = 0;
      Serial.println("[WS] 推流连接成功");
    } else if (event == WebsocketsEvent::ConnectionClosed) {
      wsConnected = false;
      unsigned long aliveMs = (wsConnectedAt > 0) ? (millis() - wsConnectedAt) : 0;
      Serial.printf("[WS] 推流连接断开，在线时长=%lu ms, RSSI=%d\n", aliveMs, WiFi.RSSI());
    }
  });
  wsClient.addHeader("Origin", "https://stream.rose980.eu.cc");
  wsClient.addHeader("User-Agent", "ESP32-CAM");

  if (loadStoredWiFiCredentials()) {
    connectTargetSsid = savedWiFiSsid;
    connectTargetPassword = savedWiFiPassword;
    connectWiFi();
  } else {
    startProvisioningAp("首次启动未发现已保存的 Wi‑Fi");
  }
}

void loop() {
  unsigned long now = millis();

  provisioningServer.handleClient();
  maintainWiFiConnection();

  if (WiFi.status() != WL_CONNECTED) {
    if (wifiWasConnected) {
      wifiWasConnected = false;
      Serial.println("[WiFi] 已断开，等待恢复或重新配网");
      wsConnected = false;
      if (wsClient.available()) wsClient.close();
    }

    delay(10);
    return;
  }

  if (!wifiWasConnected) {
    wifiWasConnected = true;
    wifiHasEverConnected = true;
    wifiControlState = WiFiControlState::CONNECTED;
    Serial.printf("[WiFi] 连接成功，SSID=%s, IP=%s\n", WiFi.SSID().c_str(), WiFi.localIP().toString().c_str());

    if (pendingCredentialSave) {
      saveStoredWiFiCredentials(connectTargetSsid, connectTargetPassword);
      pendingCredentialSave = false;
      provisioningMessage = String("已连接并保存 Wi‑Fi: ") + connectTargetSsid;
    } else {
      provisioningMessage = String("已连接 Wi‑Fi: ") + WiFi.SSID();
    }

    stopProvisioningAp();

    if (enablePortalAuth) {
      doPortalAuth();
      previousAuthTime = now;
      testInternet();
    }
    syncTimeIfNeeded();
  }

  if (enablePortalAuth && now - previousAuthTime >= authInterval) {
    previousAuthTime = now;
    Serial.println("[Portal] 认证间隔到期，执行续期认证");
    doPortalAuth();
  }

  if (!hasIPv6 && ipv6TryCount < ipv6MaxRetry && now - lastIPv6TryTime >= ipv6RetryInterval) {
    requestIPv6("loop-retry");
  } else if (!hasIPv6 && ipv6TryCount >= ipv6MaxRetry && !ipv6RetryExhaustedLogged) {
    ipv6RetryExhaustedLogged = true;
    Serial.println("[WiFi] IPv6 多次申请仍未成功，当前热点可能未向 STA 分配 IPv6");
  }

  if (!mqttClient.connected() && now - lastMqttConnectAttempt >= mqttReconnectInterval) {
    lastMqttConnectAttempt = now;
    connectMQTT();
  }

  if (mqttClient.connected()) {
    mqttClient.loop();
    if (now - lastHeartbeatTime >= mqttHeartbeatInterval) {
      lastHeartbeatTime = now;
      publishHeartbeat();
    }
  }

  if (!wsClient.available() && now - lastWsConnectAttempt >= wsReconnectInterval) {
    lastWsConnectAttempt = now;
    connectStreamWs();
  }

  wsClient.poll();
  sendStreamFrameIfReady();

  if (wsClient.available() && now - lastWsPingTime >= wsPingInterval) {
    if (!wsClient.ping()) {
      Serial.println("[WS] ping 失败，主动重连");
      wsClient.close();
      wsConnected = false;
    }
    lastWsPingTime = now;
  }

  delay(2);
}

void syncTimeIfNeeded() {
  if (!mqttUseTls || mqttUsingInsecure) return;

  Serial.println("[NTP] 正在同步时间");
  configTime(0, 0, "ntp.aliyun.com", "pool.ntp.org", "time.google.com");

  time_t now = time(nullptr);
  int retry = 0;
  while (now < 1700000000 && retry < 20) {
    delay(500);
    Serial.print(".");
    now = time(nullptr);
    retry++;
  }

  if (now >= 1700000000) {
    Serial.printf("\n[NTP] 时间同步成功: %s", ctime(&now));
  } else {
    Serial.println("\n[NTP] 时间同步失败，TLS 校验可能失败");
  }
}

void onWiFiEvent(WiFiEvent_t event) {
  switch (event) {
    case ARDUINO_EVENT_WIFI_STA_CONNECTED: {
      requestIPv6("STA_CONNECTED");
      break;
    }

    case ARDUINO_EVENT_WIFI_STA_GOT_IP: {
      wifiControlState = WiFiControlState::CONNECTED;
      wifiConnectStartedAt = 0;
      requestIPv6("STA_GOT_IP");
      break;
    }

    case ARDUINO_EVENT_WIFI_STA_GOT_IP6: {
      refreshIPv6Status(true);
      ipv6RetryExhaustedLogged = false;
      break;
    }

    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
      hasIPv6 = false;
      currentIPv6 = "";
      currentIPv6Type = "NONE";
      lastIPv6TryTime = 0;
      ipv6TryCount = 0;
      ipv6RetryExhaustedLogged = false;
      if (wifiControlState != WiFiControlState::PROVISIONING) {
        wifiControlState = WiFiControlState::CONNECTING;
        if (wifiConnectStartedAt == 0) {
          wifiConnectStartedAt = millis();
        }
      }
      break;

    default:
      break;
  }
}

void requestIPv6(const char* reason) {
  if (WiFi.status() != WL_CONNECTED) return;
  bool ok = WiFi.enableIpV6();
  lastIPv6TryTime = millis();
  if (ipv6TryCount < 255) {
    ipv6TryCount++;
  }
  Serial.printf("[WiFi] IPv6 申请(%s): %s, 次数=%u\n", reason, ok ? "已发送" : "失败", ipv6TryCount);
}

