1033087886/esp32-cam/src/main.cpp
const char* classifyIPv6Type(const esp_ip6_addr_t& addr) {
  const ip6_addr_t* lwipAddr = reinterpret_cast<const ip6_addr_t*>(&addr);
  if (ip6_addr_isglobal(lwipAddr)) return "GLOBAL";
  if (ip6_addr_isuniquelocal(lwipAddr)) return "ULA";
  if (ip6_addr_islinklocal(lwipAddr)) return "LINK_LOCAL";
  if (ip6_addr_isloopback(lwipAddr)) return "LOOPBACK";
  return "OTHER";
}

int ipv6TypeScore(const char* type) {
  if (strcmp(type, "GLOBAL") == 0) return 4;
  if (strcmp(type, "ULA") == 0) return 3;
  if (strcmp(type, "LINK_LOCAL") == 0) return 2;
  if (strcmp(type, "OTHER") == 0) return 1;
  return 0;
}

void refreshIPv6Status(bool verbose) {
  hasIPv6 = false;
  currentIPv6 = "";
  currentIPv6Type = "NONE";

  esp_netif_t* staNetif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
  if (staNetif == nullptr) {
    if (verbose) {
      Serial.println("[WiFi] IPv6 查询失败: STA netif 不存在");
    }
    return;
  }

  esp_ip6_addr_t ip6List[5] = {};
  int count = esp_netif_get_all_ip6(staNetif, ip6List);
  if (count <= 0) {
    if (verbose) {
      Serial.println("[WiFi] 当前没有可用 IPv6 地址");
    }
    return;
  }

  int bestScore = -1;
  for (int i = 0; i < count; i++) {
    IPv6Address ip6(ip6List[i].addr);
    String addr = ip6.toString();
    if (addr.length() == 0 || addr == "::") {
      continue;
    }

    const char* type = classifyIPv6Type(ip6List[i]);
    if (verbose) {
      Serial.printf("[WiFi] IPv6[%d]=%s, type=%s\n", i, addr.c_str(), type);
    }

    int score = ipv6TypeScore(type);
    if (score > bestScore) {
      bestScore = score;
      currentIPv6 = addr;
      currentIPv6Type = String(type);
    }
  }

  hasIPv6 = bestScore >= 0;
  if (verbose && hasIPv6) {
    Serial.printf("[WiFi] IPv6 已选择: %s (%s)\n", currentIPv6.c_str(), currentIPv6Type.c_str());
    if (currentIPv6Type == "LINK_LOCAL") {
      Serial.println("[WiFi] 提示: LINK_LOCAL 不能直接公网访问");
    }
  }
}

void connectWiFi() {
  if (connectTargetSsid.length() == 0) {
    startProvisioningAp("未提供 Wi‑Fi 配置");
    return;
  }

  WiFi.mode((provisioningApActive || pendingCredentialSave) ? WIFI_AP_STA : WIFI_STA);
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  WiFi.begin(connectTargetSsid.c_str(), connectTargetPassword.c_str());

  wifiControlState = WiFiControlState::CONNECTING;
  wifiConnectStartedAt = millis();
  lastWifiRetryTime = wifiConnectStartedAt;
  provisioningMessage = pendingCredentialSave
    ? String("正在测试新 Wi‑Fi: ") + connectTargetSsid
    : String("正在连接已保存 Wi‑Fi: ") + connectTargetSsid;

  Serial.printf("[WiFi] 正在连接 %s%s\n", connectTargetSsid.c_str(), pendingCredentialSave ? " (新配置测试)" : "");
}

const char* wifiControlStateToString(WiFiControlState state) {
  switch (state) {
    case WiFiControlState::BOOT: return "BOOT";
    case WiFiControlState::CONNECTING: return "CONNECTING";
    case WiFiControlState::CONNECTED: return "CONNECTED";
    case WiFiControlState::PROVISIONING: return "PROVISIONING";
    default: return "UNKNOWN";
  }
}

const char* wifiAuthModeToString(wifi_auth_mode_t authMode) {
  switch (authMode) {
    case WIFI_AUTH_OPEN: return "OPEN";
    case WIFI_AUTH_WEP: return "WEP";
    case WIFI_AUTH_WPA_PSK: return "WPA";
    case WIFI_AUTH_WPA2_PSK: return "WPA2";
    case WIFI_AUTH_WPA_WPA2_PSK: return "WPA/WPA2";
    case WIFI_AUTH_WPA2_ENTERPRISE: return "WPA2-ENT";
    case WIFI_AUTH_WPA3_PSK: return "WPA3";
    case WIFI_AUTH_WPA2_WPA3_PSK: return "WPA2/WPA3";
    default: return "UNKNOWN";
  }
}

String escapeJson(const String& value) {
  String out;
  out.reserve(value.length() + 8);
  for (size_t i = 0; i < value.length(); i++) {
    char ch = value[i];
    switch (ch) {
      case '\\': out += "\\\\"; break;
      case '"': out += "\\\""; break;
      case '\n': out += "\\n"; break;
      case '\r': out += "\\r"; break;
      case '\t': out += "\\t"; break;
      default: out += ch; break;
    }
  }
  return out;
}

bool loadStoredWiFiCredentials() {
  savedWiFiSsid = "";
  savedWiFiPassword = "";

  if (wifiPrefs.begin(wifiPrefsNamespace, false)) {
    bool valid = wifiPrefs.getBool("valid", false);
    uint32_t version = wifiPrefs.getUInt("version", 0);
    if (valid && version == wifiPrefsVersion) {
      savedWiFiSsid = wifiPrefs.getString("ssid", "");
      savedWiFiPassword = wifiPrefs.getString("password", "");
    }
    wifiPrefs.end();
  }

  if (savedWiFiSsid.length() == 0) {
    String defaultSsid = DEFAULT_WIFI_SSID;
    String defaultPassword = DEFAULT_WIFI_PASSWORD;
    if (defaultSsid.length() > 0) {
      savedWiFiSsid = defaultSsid;
      savedWiFiPassword = defaultPassword;
      Serial.printf("[WiFi] 使用编译默认网络: %s\n", savedWiFiSsid.c_str());
    }
  }

  return savedWiFiSsid.length() > 0;
}

void saveStoredWiFiCredentials(const String& ssid, const String& password) {
  if (!wifiPrefs.begin(wifiPrefsNamespace, false)) {
    Serial.println("[WiFi] 保存配置失败: NVS 打开失败");
    return;
  }

  wifiPrefs.putUInt("version", wifiPrefsVersion);
  wifiPrefs.putBool("valid", true);
  wifiPrefs.putString("ssid", ssid);
  wifiPrefs.putString("password", password);
  wifiPrefs.end();

  savedWiFiSsid = ssid;
  savedWiFiPassword = password;
  Serial.printf("[WiFi] 已保存配置: %s\n", ssid.c_str());
}

void clearStoredWiFiCredentials() {
  if (!wifiPrefs.begin(wifiPrefsNamespace, false)) {
    Serial.println("[WiFi] 清除配置失败: NVS 打开失败");
    return;
  }
  wifiPrefs.clear();
  wifiPrefs.end();

  savedWiFiSsid = "";
  savedWiFiPassword = "";
  connectTargetSsid = "";
  connectTargetPassword = "";
  Serial.println("[WiFi] 已清除已保存的 Wi‑Fi 配置");
}

String buildProvisioningStatusJson() {
  const bool connected = WiFi.status() == WL_CONNECTED;
  String json = "{";
  json += "\"device_id\":\"" + escapeJson(deviceId) + "\",";
  json += "\"state\":\"" + String(wifiControlStateToString(wifiControlState)) + "\",";
  json += "\"connected\":";
  json += connected ? "true" : "false";
  json += ",";
  json += "\"connected_ssid\":\"" + escapeJson(connected ? WiFi.SSID() : String()) + "\",";
  json += "\"saved_ssid\":\"" + escapeJson(savedWiFiSsid) + "\",";
  json += "\"sta_ip\":\"" + escapeJson(connected ? WiFi.localIP().toString() : String()) + "\",";
  json += "\"ap_ssid\":\"" + escapeJson(provisioningApActive ? provisioningApSsid : String()) + "\",";
  json += "\"ap_ip\":\"" + escapeJson(provisioningApActive ? WiFi.softAPIP().toString() : String()) + "\",";
  json += "\"message\":\"" + escapeJson(provisioningMessage) + "\"";
  json += "}";
  return json;
}

void handleProvisioningRoot() {
  provisioningServer.send_P(200, "text/html; charset=utf-8", provisioningPageHtml);
}

void handleProvisioningStatus() {
  provisioningServer.send(200, "application/json; charset=utf-8", buildProvisioningStatusJson());
}

