1033087886/esp32-cam/src/main.cpp
void handleProvisioningScan() {
  WiFi.scanDelete();
  int count = WiFi.scanNetworks();

  String json = "{\"ok\":true,\"networks\":[";
  bool first = true;

  if (count > 0) {
    for (int i = 0; i < count; i++) {
      String ssid = WiFi.SSID(i);
      if (ssid.length() == 0) {
        continue;
      }
      if (!first) {
        json += ",";
      }
      first = false;
      json += "{\"ssid\":\"" + escapeJson(ssid) + "\",";
      json += "\"rssi\":" + String(WiFi.RSSI(i)) + ",";
      json += "\"auth\":\"" + String(wifiAuthModeToString(static_cast<wifi_auth_mode_t>(WiFi.encryptionType(i)))) + "\"}";
    }
  }

  json += "]";
  if (count <= 0) {
    json += ",\"message\":\"没有扫描到 Wi‑Fi，请手动输入隐藏 SSID\"";
  }
  json += "}";

  WiFi.scanDelete();
  provisioningServer.send(200, "application/json; charset=utf-8", json);
}

void handleProvisioningConnect() {
  String ssid = provisioningServer.arg("ssid");
  String password = provisioningServer.arg("password");
  ssid.trim();

  if (ssid.length() == 0) {
    provisioningServer.send(400, "application/json; charset=utf-8", "{\"ok\":false,\"message\":\"SSID 不能为空\"}");
    return;
  }

  pendingProvisionSsid = ssid;
  pendingProvisionPassword = password;
  pendingProvisionRequest = true;
  provisioningMessage = String("已收到新配置，准备连接: ") + ssid;

  provisioningServer.send(200, "application/json; charset=utf-8", "{\"ok\":true,\"message\":\"已开始连接新 Wi‑Fi，请等待 10~20 秒\"}");
}

void handleProvisioningReset() {
  pendingResetRequest = true;
  provisioningMessage = "准备清除已保存配置";
  provisioningServer.send(200, "application/json; charset=utf-8", "{\"ok\":true,\"message\":\"已开始清除配置，设备将重新进入配网模式\"}");
}

void handleProvisioningNotFound() {
  provisioningServer.sendHeader("Location", "/");
  provisioningServer.send(302, "text/plain", "redirect");
}

void setupProvisioningServer() {
  provisioningServer.on("/", HTTP_GET, handleProvisioningRoot);
  provisioningServer.on("/scan", HTTP_GET, handleProvisioningScan);
  provisioningServer.on("/connect", HTTP_POST, handleProvisioningConnect);
  provisioningServer.on("/status", HTTP_GET, handleProvisioningStatus);
  provisioningServer.on("/reset", HTTP_POST, handleProvisioningReset);
  provisioningServer.onNotFound(handleProvisioningNotFound);
}

void startProvisioningAp(const char* reason) {
  if (provisioningApSsid.length() == 0) {
    uint64_t chipId = ESP.getEfuseMac();
    char suffix[5] = {};
    snprintf(suffix, sizeof(suffix), "%04X", static_cast<unsigned int>(chipId & 0xFFFFULL));
    provisioningApSsid = String(provisioningApPrefix) + suffix;
  }

  if (mqttClient.connected()) {
    mqttClient.disconnect();
  }
  if (wsClient.available()) {
    wsClient.close();
  }
  wsConnected = false;
  wifiWasConnected = false;
  wifiControlState = WiFiControlState::PROVISIONING;
  wifiConnectStartedAt = 0;

  WiFi.disconnect();
  WiFi.mode(WIFI_AP_STA);
  WiFi.setSleep(false);
  WiFi.softAPConfig(provisioningApIp, provisioningApIp, IPAddress(255, 255, 255, 0));

  if (!provisioningApActive) {
    provisioningApActive = WiFi.softAP(provisioningApSsid.c_str());
  }

  if (provisioningApActive && !provisioningServerStarted) {
    provisioningServer.begin();
    provisioningServerStarted = true;
    Serial.println("[WEB] 配网页服务已启动");
  }

  provisioningMessage = String(reason) + "。请连接热点 " + provisioningApSsid + "，然后打开 192.168.4.1";
  Serial.printf("[WiFi] 进入配网模式，AP=%s, IP=%s\n", provisioningApSsid.c_str(), WiFi.softAPIP().toString().c_str());
}

void stopProvisioningAp() {
  if (!provisioningApActive) {
    return;
  }

  WiFi.softAPdisconnect(true);
  provisioningApActive = false;
  WiFi.mode(WIFI_STA);
  Serial.println("[WiFi] 已关闭配网热点");
}

void beginProvisioningCandidate(const String& ssid, const String& password) {
  if (!provisioningApActive) {
    startProvisioningAp("准备切换到新的 Wi‑Fi");
  }

  connectTargetSsid = ssid;
  connectTargetPassword = password;
  pendingCredentialSave = true;
  connectWiFi();
}

void maintainWiFiConnection() {
  unsigned long now = millis();

  if (pendingResetRequest) {
    pendingResetRequest = false;
    pendingProvisionRequest = false;
    pendingCredentialSave = false;
    clearStoredWiFiCredentials();
    startProvisioningAp("已清除已保存的 Wi‑Fi 配置");
    return;
  }

  if (pendingProvisionRequest) {
    pendingProvisionRequest = false;
    beginProvisioningCandidate(pendingProvisionSsid, pendingProvisionPassword);
    return;
  }

  if (wifiControlState != WiFiControlState::CONNECTING) {
    return;
  }

  if (WiFi.status() == WL_CONNECTED) {
    return;
  }

  if (now - lastWifiRetryTime >= wifiReconnectInterval) {
    lastWifiRetryTime = now;
    WiFi.reconnect();
  }

  unsigned long timeout = (pendingCredentialSave || !wifiHasEverConnected)
    ? wifiConnectTimeoutInitial
    : wifiConnectTimeoutRecovery;

  if (wifiConnectStartedAt == 0 || now - wifiConnectStartedAt < timeout) {
    return;
  }

  WiFi.disconnect();

  if (pendingCredentialSave) {
    pendingCredentialSave = false;
    connectTargetSsid = "";
    connectTargetPassword = "";
    startProvisioningAp("新 Wi‑Fi 连接失败");
    provisioningMessage = "新 Wi‑Fi 连接失败，请检查密码、频段或信号强度";
    return;
  }

  if (savedWiFiSsid.length() > 0) {
    startProvisioningAp("已保存的 Wi‑Fi 连接超时");
    provisioningMessage = "旧 Wi‑Fi 长时间不可用，请重新配网";
  } else {
    startProvisioningAp("未找到已保存 Wi‑Fi");
  }
}

void setupTopics() {
  String base = String("esp32cam/") + deviceId;
  topicCmdLight = base + "/cmd/light";
  topicStateLight = base + "/state/light";
  topicStateOnline = base + "/state/online";
  topicStateHeartbeat = base + "/state/heartbeat";
  topicAck = base + "/ack";
}

void setupFlashPwm() {
  pinMode(flashLedPin, OUTPUT);

  if (useNewLedcApi) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
    if (!ledcAttach(flashLedPin, 5000, 8)) {
      Serial.println("[LED] ledcAttach 初始化失败");
    }
#endif
  } else {
#if !defined(ESP_ARDUINO_VERSION_MAJOR) || (ESP_ARDUINO_VERSION_MAJOR < 3)
    ledcSetup(flashLedChannel, 5000, 8);
    ledcAttachPin(flashLedPin, flashLedChannel);
#endif
  }

  setFlashBrightness(0, false);
}

