1033087886/esp32-cam/src/main.cpp
void setFlashBrightness(uint8_t value, bool reportState) {
  currentLight = value;

  if (useNewLedcApi) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
    ledcWrite(flashLedPin, currentLight);
#endif
  } else {
#if !defined(ESP_ARDUINO_VERSION_MAJOR) || (ESP_ARDUINO_VERSION_MAJOR < 3)
    ledcWrite(flashLedChannel, currentLight);
#endif
  }

  Serial.printf("[LED] 当前亮度=%u\n", currentLight);

  if (reportState) {
    publishLightState();
  }
}

void publishLightState() {
  if (!mqttClient.connected()) return;

  String payload = String("{\"light\":") + String(currentLight) + ",\"pin\":" + String(flashLedPin) + "}";
  if (mqttClient.publish(topicStateLight.c_str(), payload.c_str(), true)) {
    Serial.println("[MQTT] 亮度状态: " + payload);
  }
}

void publishHeartbeat() {
  if (!mqttClient.connected()) return;

  String payload = "{";
  payload += "\"ip\":\"" + WiFi.localIP().toString() + "\",";
  if (hasIPv6 && currentIPv6.length() > 0) {
    payload += "\"ipv6\":\"" + currentIPv6 + "\",";
    payload += "\"ipv6_type\":\"" + currentIPv6Type + "\",";
  }
  payload += "\"mac\":\"" + WiFi.macAddress() + "\",";
  payload += "\"rssi\":" + String(WiFi.RSSI()) + ",";
  payload += "\"light\":" + String(currentLight);
  payload += "}";

  if (mqttClient.publish(topicStateHeartbeat.c_str(), payload.c_str(), false)) {
    Serial.println("[MQTT] 心跳: " + payload);
  }
}

void publishAck(const char* msg) {
  if (!mqttClient.connected()) return;
  mqttClient.publish(topicAck.c_str(), msg, false);
}
void setupMqttTransport() {
  if (!mqttUseTls) {
    mqttClient.setClient(mqttPlainClient);
    mqttUsingInsecure = true;
    Serial.println("[MQTT] 使用明文 TCP 模式（1883）");
    return;
  }

  mqttClient.setClient(mqttTlsClient);

  if (strstr(mqttCaCert, "PASTE_YOUR_CA_CERT_HERE") != nullptr) {
    mqttUsingInsecure = true;
    mqttTlsClient.setInsecure();
    Serial.println("[MQTT] TLS 未配置 CA，已启用 setInsecure");
  } else {
    mqttUsingInsecure = false;
    mqttTlsClient.setCACert(mqttCaCert);
    Serial.println("[MQTT] TLS 已加载 CA 证书");
  }
}

void doPortalAuth() {
  if (!enablePortalAuth || WiFi.status() != WL_CONNECTED) return;

  HTTPClient http;

  String staIp = WiFi.localIP().toString();
  String staMac = WiFi.macAddress();
  String apMac = WiFi.BSSIDstr();
  staMac.toLowerCase();
  apMac.toLowerCase();

  String authUrl = String(portalAuthBaseUrl);
  authUrl += "?btn_onekey=true";
  authUrl += "&authtype=2";
  authUrl += "&pagetype=2";
  authUrl += "&vlan=4095";
  authUrl += "&staMac=" + staMac;
  authUrl += "&staIp=" + staIp;
  authUrl += "&apMac=" + apMac;
  authUrl += "&apIp=" + staIp;
  authUrl += "&supportTPAuth=true";

  Serial.println("[Portal] 请求地址: " + authUrl);

  http.begin(authUrl);
  int httpCode = http.GET();

  if (httpCode > 0) {
    Serial.printf("[Portal] HTTP 状态码: %d\n", httpCode);
    if (httpCode == 200) {
      Serial.println("[Portal] 认证完成");
    }
  } else {
    Serial.printf("[Portal] 认证失败: %s\n", HTTPClient::errorToString(httpCode).c_str());
  }

  http.end();
}

void testInternet() {
  if (WiFi.status() != WL_CONNECTED) return;

  HTTPClient http;
  const char* testUrl = "http://captive.apple.com/hotspot-detect.html";
  const char* headerKeys[] = {"Location"};

  Serial.println("[NET] 正在检测外网连通性");
  http.collectHeaders(headerKeys, 1);
  http.begin(testUrl);
  int code = http.GET();

  if (code < 0) {
    Serial.printf("[NET] 请求失败: %s\n", HTTPClient::errorToString(code).c_str());
  } else if (code == HTTP_CODE_OK) {
    String payload = http.getString();
    payload.toLowerCase();
    if (payload.indexOf("success") >= 0) {
      Serial.println("[NET] 外网可用");
    } else {
      Serial.println("[NET] 收到 200，但内容异常");
    }
  } else if (code == HTTP_CODE_NO_CONTENT) {
    Serial.println("[NET] 收到 204，外网大概率可用");
  } else if (code == HTTP_CODE_MOVED_PERMANENTLY ||
             code == HTTP_CODE_FOUND ||
             code == HTTP_CODE_TEMPORARY_REDIRECT ||
             code == HTTP_CODE_PERMANENT_REDIRECT) {
    Serial.printf("[NET] 发生重定向（%d），location=%s\n", code, http.header("Location").c_str());
  } else {
    Serial.printf("[NET] 异常 HTTP 状态码: %d\n", code);
  }

  http.end();
}

void connectMQTT() {
  if (mqttClient.connected() || WiFi.status() != WL_CONNECTED) return;

  String clientId = String("esp32cam-") + WiFi.macAddress();
  clientId.replace(":", "");

  Serial.printf("[MQTT] 正在连接 %s:%u, clientId=%s\n", mqttHost, mqttPort, clientId.c_str());

  bool ok = false;
  if (strlen(mqttUsername) > 0) {
    ok = mqttClient.connect(
      clientId.c_str(),
      mqttUsername,
      mqttPassword,
      topicStateOnline.c_str(),
      1,
      true,
      "offline"
    );
  } else {
    ok = mqttClient.connect(
      clientId.c_str(),
      topicStateOnline.c_str(),
      1,
      true,
      "offline"
    );
  }

  if (!ok) {
    Serial.printf("[MQTT] 连接失败, state=%d\n", mqttClient.state());
    return;
  }

  mqttClient.subscribe(topicCmdLight.c_str(), 1);
  mqttClient.publish(topicStateOnline.c_str(), "online", true);
  publishLightState();
  publishHeartbeat();
  publishAck("connected");
  lastHeartbeatTime = millis();
  Serial.println("[MQTT] 连接成功并完成订阅");
}

String extractJsonValue(const String& json, const String& key) {
  String pattern = "\"" + key + "\"";
  int keyPos = json.indexOf(pattern);
  if (keyPos < 0) return "";

  int colonPos = json.indexOf(':', keyPos + pattern.length());
  if (colonPos < 0) return "";

  int start = colonPos + 1;
  while (start < (int)json.length() && isspace((unsigned char)json[start])) {
    start++;
  }
  if (start >= (int)json.length()) return "";

  if (json[start] == '"') {
    int endQuote = json.indexOf('"', start + 1);
    if (endQuote < 0) return "";
    return json.substring(start + 1, endQuote);
  }

  int end = start;
  while (end < (int)json.length() &&
         json[end] != ',' &&
         json[end] != '}' &&
         !isspace((unsigned char)json[end])) {
    end++;
  }
  return json.substring(start, end);
}

String decodeCommandPayload(byte* payload, unsigned int length) {
  String raw;
  raw.reserve(length + 1);
  for (unsigned int i = 0; i < length; i++) {
    raw += static_cast<char>(payload[i]);
  }
  raw.trim();

  if (!raw.startsWith("{")) {
    return raw;
  }

