1033087886/esp32-cam/src/main.cpp
  String v = extractJsonValue(raw, "light");
  if (v.length() > 0) return v;

  v = extractJsonValue(raw, "msg");
  if (v.length() > 0) return v;

  return raw;
}

bool parseBrightnessCommand(String cmd, uint8_t& outValue) {
  cmd.trim();
  cmd.toLowerCase();

  if (cmd == "on" || cmd == "led/on" || cmd == "1") {
    outValue = 255;
    return true;
  }

  if (cmd == "off" || cmd == "led/off" || cmd == "0") {
    outValue = 0;
    return true;
  }

  char* endPtr = nullptr;
  long value = strtol(cmd.c_str(), &endPtr, 10);
  if (*endPtr != '\0') {
    return false;
  }

  if (value < 0) value = 0;
  if (value > 255) value = 255;
  outValue = static_cast<uint8_t>(value);
  return true;
}

void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String cmd = decodeCommandPayload(payload, length);
  String cmdLower = cmd;
  cmdLower.toLowerCase();

  Serial.printf("[MQTT] 收到消息 topic=%s payload=%s\n", topic, cmd.c_str());

  if (strcmp(topic, topicCmdLight.c_str()) != 0) {
    return;
  }

  if (cmdLower == "ping") {
    publishAck("pong");
    return;
  }

  if (cmdLower == "auth") {
    doPortalAuth();
    publishAck("portal-auth-done");
    return;
  }

  if (cmdLower == "status" || cmdLower == "light/status") {
    publishLightState();
    publishAck("light-status");
    return;
  }

  if (cmdLower == "toggle" || cmdLower == "light/toggle") {
    setFlashBrightness(currentLight > 0 ? 0 : 255, true);
    publishAck("light-toggle");
    return;
  }

  uint8_t nextValue = 0;
  if (parseBrightnessCommand(cmd, nextValue)) {
    setFlashBrightness(nextValue, true);
    publishAck("light-updated");
  } else {
    publishAck("unknown-cmd");
    Serial.println("[MQTT] 无效亮度命令，请用 0-255/on/off/toggle");
  }
}

const char* cameraSensorProfileToString(CameraSensorProfile profile) {
  switch (profile) {
    case CameraSensorProfile::OV2640: return "OV2640";
    case CameraSensorProfile::OV3660: return "OV3660";
    case CameraSensorProfile::GC2145: return "GC2145";
    default: return "UNKNOWN";
  }
}

CameraSensorProfile cameraSensorProfileFromPid(uint16_t pid) {
  if (pid == OV2640_PID) return CameraSensorProfile::OV2640;
  if (pid == OV3660_PID) return CameraSensorProfile::OV3660;
  if (pid == GC2145_PID) return CameraSensorProfile::GC2145;
  return CameraSensorProfile::UNKNOWN;
}

CameraSensorProfile parseForcedSensorProfile(
  const char* raw,
  bool* forceEnabled,
  bool* valueValid,
  char* normalized,
  size_t normalizedSize
) {
  if (forceEnabled != nullptr) *forceEnabled = false;
  if (valueValid != nullptr) *valueValid = false;
  if (normalized != nullptr && normalizedSize > 0) {
    normalized[0] = '\0';
  }

  const char* source = (raw != nullptr) ? raw : "";
  char token[24] = {0};
  size_t writePos = 0;

  for (size_t i = 0; source[i] != '\0' && writePos < sizeof(token) - 1; i++) {
    const unsigned char ch = static_cast<unsigned char>(source[i]);
    if (isspace(ch) || ch == '"' || ch == '\'' || ch == '-' || ch == '_') {
      continue;
    }
    token[writePos++] = static_cast<char>(tolower(ch));
  }
  token[writePos] = '\0';

  if (writePos == 0) {
    strcpy(token, "auto");
    writePos = strlen(token);
  }

  if (normalized != nullptr && normalizedSize > 0) {
    const size_t copyLen = (writePos < normalizedSize - 1) ? writePos : (normalizedSize - 1);
    memcpy(normalized, token, copyLen);
    normalized[copyLen] = '\0';
  }

  if (strcmp(token, "auto") == 0) {
    if (valueValid != nullptr) *valueValid = true;
    if (forceEnabled != nullptr) *forceEnabled = false;
    return CameraSensorProfile::UNKNOWN;
  }
  if (strcmp(token, "ov2640") == 0) {
    if (valueValid != nullptr) *valueValid = true;
    if (forceEnabled != nullptr) *forceEnabled = true;
    return CameraSensorProfile::OV2640;
  }
  if (strcmp(token, "ov3660") == 0) {
    if (valueValid != nullptr) *valueValid = true;
    if (forceEnabled != nullptr) *forceEnabled = true;
    return CameraSensorProfile::OV3660;
  }
  if (strcmp(token, "gc2145") == 0) {
    if (valueValid != nullptr) *valueValid = true;
    if (forceEnabled != nullptr) *forceEnabled = true;
    return CameraSensorProfile::GC2145;
  }

  return CameraSensorProfile::UNKNOWN;
}

const char* pixformatToString(pixformat_t pixformat) {
  if (pixformat == PIXFORMAT_JPEG) return "JPEG";
  return "NON_JPEG";
}

const char* frameSizeToString(framesize_t frameSize) {
  if (frameSize == FRAMESIZE_QVGA) return "QVGA";
  if (frameSize == FRAMESIZE_VGA) return "VGA";
  return "OTHER";
}

template <typename T>
bool applySensorSetting(sensor_t* sensor, const char* settingName, T value, int (*setter)(sensor_t*, T)) {
  if (sensor == nullptr || setter == nullptr) {
    Serial.printf("[CAM] 参数设置失败: %s=%d, setter 不可用\n", settingName, static_cast<int>(value));
    return false;
  }

  const int rc = setter(sensor, value);
  if (rc != 0) {
    Serial.printf("[CAM] 参数设置失败: %s=%d, rc=%d\n", settingName, static_cast<int>(value), rc);
    return false;
  }
  return true;
}

bool initCamera() {
  const char* forceRaw = CAM_STRINGIFY(CAM_FORCE_SENSOR);
  char forceNormalized[16] = {0};
  bool forceEnabled = false;
  bool forceValid = false;
  const CameraSensorProfile forcedProfile = parseForcedSensorProfile(
    forceRaw,
    &forceEnabled,
    &forceValid,
    forceNormalized,
    sizeof(forceNormalized)
  );
  if (!forceValid) {
    Serial.printf(
      "[CAM] CAM_FORCE_SENSOR 配置无效: raw=%s, 仅支持 auto/ov2640/ov3660/gc2145，已回退 auto\n",
      forceRaw
    );
  }
  Serial.printf(
    "[CAM] CAM_FORCE_SENSOR raw=%s parsed=%s enabled=%s\n",
    forceRaw,
    forceNormalized,
    forceEnabled ? "yes" : "no"
  );
  Serial.printf(
    "[CAM] 依赖检查: gc2145 header hint=%s\n",
    HAS_GC2145_DRIVER_HEADER_HINT ? "found" : "not-found"
  );

  camera_config_t config;
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;
  config.pin_xclk = XCLK_GPIO_NUM;
  config.pin_pclk = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href = HREF_GPIO_NUM;
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
  config.pin_pwdn = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;

  const bool hasPsram = psramFound();
  framesize_t targetFrameSize = hasPsram ? streamFrameSizePsram : streamFrameSizeNoPsram;
  if (forceEnabled &&
      forcedProfile == CameraSensorProfile::GC2145 &&
      targetFrameSize != FRAMESIZE_QVGA &&
      targetFrameSize != FRAMESIZE_VGA) {
    targetFrameSize = hasPsram ? FRAMESIZE_VGA : FRAMESIZE_QVGA;
    Serial.printf("[CAM] GC2145 模式已调整分辨率到 %s\n", frameSizeToString(targetFrameSize));
  }

